---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetWalkLines
source: html/afec951a-486e-d276-dc89-b6132bc26066.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetWalkLines Method

Gets walk lines.

## Syntax (C#)
```csharp
public IList<IList<Curve>> GetWalkLines()
```

## Returns
The walk lines.